export const headingDescriptions = {
  attribute: 'HTML要素に付与する追加情報であり、要素の挙動などを指定するものです。開始タグに記述し、基本的には「属性名="属性値"」で指定します。全てのHTML要素にはグローバル属性が存在し、さらに固有の属性が存在する場合もあります。',
  charset: '文書の文字エンコーディングを指定します。値は大文字小文字の区別なく"utf-8"にする必要があります。',
  class: 'HTML要素にクラスを付与する属性です。idと違い、同じHTML文書内に同じclassを持つHTML要素を複数配置することが出来ます。classは1つのHTML要素に1つ以上のクラスを空白区切りで指定することが出来ます。',
  description: 'ウェブページの内容を要約した説明文を指定します。ウェブブラウザの検索結果ページにおけるサイト説明などで使用されます。',
  head: 'HTML文書のhead部のコードは以下の様になります。head部の内容はウェブページに表示されることはありませんが、ウェブページに必要な情報などを記述します。このコードはダウンロード時に自動挿入されるため、コードエリアに記述する必要はありません。',
  id: 'HTML要素に一意な識別子を付与する属性です。同じHTML文書内に同じidを持つHTML要素を記述してはいけません。idは1つのHTML要素に1つだけ指定出来ます。',
  title: 'ウェブページのタイトルをテキストで指定します。ウェブブラウザのタブ名やブックマーク名などで使用されます。',
}
